app/Http/Controllers/SiteController.php

    public function index()
    {
        $count = Page::where('tempname', $this->activeTemplate)->where('slug', 'home')->count();
        if ($count == 0) {
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }
        $pageTitle = 'Home';
        $sections = Page::where('tempname', $this->activeTemplate)->where('slug', 'home')->first();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();
---
select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1

    public function donorDetails($slug, $id)
    {
        $pageTitle = "Donor Details";
        $donor = Donor::where('status', 1)->where('id', decrypt($id))->firstOrFail();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();
---
select * from `donors` where `status` = 1 and `id` = 425 limit 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1